lib/tasks/dev.rake

SELECT "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  task add_coins: :environment do
    if Rails.env.development?
      show_spinner('Criando moedas','Moedas criadas') do
        coins_to_create = [
          {
              description: "Bitcoin",
              acronym: "BTC",
              url_image: "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Bitcoin.svg/1200px-Bitcoin.svg.png",
              mining_type: MiningType.find_by(acronym: 'PoW')
          },
          {
              description: "Ethereum",
              acronym: "ETH",
              url_image: "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Ethereum-icon-purple.svg/512px-Ethereum-icon-purple.svg.png?20200227011040",
              mining_type: MiningType.all.sample
          },
          {
              description: "Dash",
              acronym: "DASH",
              url_image: "https://cdn2.iconfinder.com/data/icons/bitcoin-73/128/dash-512.png",
              mining_type: MiningType.all.sample
          },
          {
              description: "Iota",
              acronym: "IOT",
              url_image: "https://cdn-icons-png.flaticon.com/512/7829/7829646.png",
              mining_type: MiningType.all.sample
          },
          {
              description: "ZCash",
              acronym: "ZEC",
              url_image: "https://cdn-icons-png.flaticon.com/512/1418/1418194.png",
              mining_type: MiningType.all.sample
          }
        ]
        coins_to_create.each do |coin|
          Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2023-12-20 13:40:49.513011"], ["updated_at", "2023-12-20 13:40:49.513011"]]
---
  task add_mining_types: :environment do
    if Rails.env.development?
      show_spinner('Criando Tipes de mineração','Tipes de mineração criadas') do
        mine_types = [
          {
            description: "Proof of Work",
            acronym: "PoW"
          },
          {
            description: "Proof of Stake",
            acronym: "PoS"
          },
          {
            description: "Proof of Capacity",
            acronym: "PoC"
          }
        ]
        mine_types.each do |mt|
          MiningType.find_or_create_by!(mt)