app/controllers/coins_controller.rb

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["description", ""], ["acronym", ""], ["url_image", ""], ["created_at", "2023-12-20 15:25:31.054950"], ["updated_at", "2023-12-20 15:25:31.054950"], ["mining_type_id", 1]]

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "updated_at" = ?, "mining_type_id" = ? WHERE "coins"."id" = ?  [["updated_at", "2023-12-20 15:26:14.985280"], ["mining_type_id", 2], ["id", 3]]

  def destroy
    @coin.destroy!
---
DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 3]]

    def set_mining_type_options
      @mining_type_option = MiningType.all.pluck(:description, :id)
---
SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"